PaymentCreateAllISPC/results/20211007/BMPaymentV16/PAYCTFORDOMOUTAX_Auth20211007150956277.txt

Status: FAIL
Time Taken: 3556
Size: 0
Timestamp: Thu Oct 07 15:09:52 IST 2021
TestStep: Auth

----------------- Messages ------------------------------
org.apache.http.conn.HttpHostConnectException: Connect to 10.246.89.109:20811 [/10.246.89.109] failed: Connection refused: connect

----------------- Properties ------------------------------
Endpoint: http://10.246.89.109:20811/pin/services/PINSPaymentAuthorization_V1_3
Encoding: UTF-8

---------------- Request ---------------------------
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:wsc="http://edb.com/ws/WSCommon_v21" xmlns:urn="urn:pins.payment.evry.com:ws:paymentauthorization:v1_3" xmlns:urn1="urn:pins.payment.evry.com:domain:paymentauthorization:v1_3" xmlns:urn2="urn:pins.payment.evry.com:domain:authorization:v1_3">
   <soapenv:Header>
      <wsc:AutHeader>
         <wsc:SourceApplication>EVRYCPS</wsc:SourceApplication>
         <wsc:DestinationApplication>PIN</wsc:DestinationApplication>
         <wsc:Function>PIN Create</wsc:Function>
         <wsc:Version>V2_0</wsc:Version>
         <wsc:ClientContext>
            <wsc:userid>27076402170</wsc:userid>
            <wsc:credentials>03110012010400425kglPboRi3h1Z4YUjUpQ0UB65Ta2kPKj1KWwkWemtrL+SoWqMxx/KuqxUVbNyTu6DsSaabKNt2t+xJppso23a37EmmmyjbdrffJeRiGWfHDGwxCWOpDYc2jgSxAz1+8eEsSaabKNt2t/XzlyjxYnxhcG46wcbIKp/sSaabKNt2t9wBUG0SyIoqFfig80Gq4uXVBtimDzTiu2xJppso23a37Emmmyjbdrf8wP73CNrvpw=apG4tU0NraPbbqKUp39erKDFa7xy6z+r4VDMr/6qBlkFniGaNeDXv4cZcZZQQI6JtwB3JYQk6WqLA7oyp1FWRM6n46ehgNmHVNly8fTnQbIuGJSF2LUyGI7aE92/dgtp8jv9bsGpNe58K+xb4LeIHwjb2nVVvt4/2oLtDQ8IPJE=</wsc:credentials>
            <wsc:channel>NBA</wsc:channel>
            <wsc:orgid>4201</wsc:orgid>
            <!--Optional:-->
            <wsc:orgunit>4201</wsc:orgunit>
            <!--Optional:-->
            <wsc:customerid>27076402170</wsc:customerid>
            <!--Optional:-->
            <wsc:locale>en</wsc:locale>
            <wsc:ip>1.1.1.1</wsc:ip>
            <!--Zero or more repetitions:-->
            <wsc:item value="27076402170" key="AgreementId"/>
            <wsc:item value="fa592eeb-e23b-462c-adb0-7c91a0316be2" key="LogRef"/>
            <wsc:item key="PaymentChannel" value="BES"/>
         </wsc:ClientContext>
      </wsc:AutHeader>
   </soapenv:Header>
   <soapenv:Body>
      <urn:PaymentAuthorizationCreateRequest>
         <urn:cpsAuthorizationMessage>
            <urn1:cpsUserAuthorizationData>
               <urn2:agreementData>
                  <urn2:agreementId>27076402170</urn2:agreementId>
                  <!--Optional:-->
                  <urn2:bankId>4201</urn2:bankId>
                  <urn2:customerID>27076402170</urn2:customerID>
                  <urn2:productID>1234232</urn2:productID>
                  <urn2:corporateGrouping>
                     <urn2:customerId>27076402170</urn2:customerId>
                     <urn2:agreementId>27076402170</urn2:agreementId>
                     <urn2:b2bPollingEnabled>false</urn2:b2bPollingEnabled>
                  </urn2:corporateGrouping>
                  <urn2:agreementAccount>
                     <urn2:accountNumber>34950211433</urn2:accountNumber>
                     <urn2:accountOwnerIdentifier>27076402170</urn2:accountOwnerIdentifier>
                     <urn2:bic>SPAVNOBBXXX</urn2:bic>
                     <urn2:currencyCode>NOK</urn2:currencyCode>
                     <urn2:accountType>ForeignBankTaxAccount</urn2:accountType>
                     <urn2:numberOfVerifiers>0</urn2:numberOfVerifiers>
                     <urn2:numberOfApprovers>1</urn2:numberOfApprovers>
                     <urn2:access>CREDIT_AND_DEBIT</urn2:access>
                  </urn2:agreementAccount>
               </urn2:agreementData>
               <urn2:userData>
                  <urn2:userId>27076402170</urn2:userId>
                  <urn2:sessionID>qw24213</urn2:sessionID>
                  <urn2:firstName>Bond</urn2:firstName>
                  <urn2:lastName>Mad</urn2:lastName>
                  <!--Optional:-->
                  <urn2:socialSecurityNumber>27076402170</urn2:socialSecurityNumber>
                  <!--Zero or more repetitions:-->
                  <urn2:userAccount>
                     <urn2:accountNumber>34950211433</urn2:accountNumber>
                     <!--Optional:-->
                     <!--Zero or more repetitions:-->
                     <urn2:role>View</urn2:role>
                     <urn2:role>Register</urn2:role>
                     <urn2:role>Appprove</urn2:role>
                     <urn2:role>Salary</urn2:role>
                     <urn2:role>Transfer</urn2:role>
                     <!--Optional:-->
                     <urn2:bookingLevel>T</urn2:bookingLevel>
                     <urn2:approvalLimit>9999999</urn2:approvalLimit>
                     <urn2:registerLimit>9999999</urn2:registerLimit>
                  </urn2:userAccount>
                  <!--Zero or more repetitions:-->
               </urn2:userData>
            </urn1:cpsUserAuthorizationData>
         </urn:cpsAuthorizationMessage>
      </urn:PaymentAuthorizationCreateRequest>
   </soapenv:Body>
</soapenv:Envelope>

---------------- Response --------------------------
- missing response / garbage collected -
